results_chameleon/container/results/disk/disk_container_16threads_20250912_002600.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      66387.61
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  259.33
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              664114

Latency (ms):
         min:                                    0.09
         avg:                                    0.24
         max:                                    3.46
         95th percentile:                        0.39
         sum:                               159773.33

Threads fairness:
    events (avg/stddev):           41507.1250/77.24
    execution time (avg/stddev):   9.9858/0.00